etc/OpenFOAM_sample_files/heat_transfer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(0.0 -2.2204460492503131e-16 -1.0)
	(10.0 -2.2204460492503131e-16 -1.0)
	(10.0 10.000000000000002 -1.0)
	(0.0 10.000000000000002 -1.0)
	(0.0 -2.2204460492503131e-16 10.0)
	(10.0 -2.2204460492503131e-16 10.0)
	(10.0 10.000000000000002 10.0)
	(0.0 10.000000000000002 10.0)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (10 10 11) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
	(1 2 6 5)
	(3 0 4 7)
	(0 1 5 4)
	(2 3 7 6)
       );
   }
);

mergePatchPair
(
);
