etc/OpenFOAM_sample_files/heat_transfer/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		snappyHexMeshDict;
}

castellatedMesh		true;

snap		false;

addLayers		false;

geometry
{

    heat_transfer.stl
    {

        type		triSurfaceMesh;

        name		heat_transfer;

        regions
        {

            room
            {

                name		room;

            }

            floor
            {

                name		floor;

            }

            roof
            {

                name		roof;

            }

        }

    }

}

castellatedMeshControls
{

    maxLocalCells		1000000;

    maxGlobalCells		2000000;

    minRefinementCells		10;

    maxLoadUnbalance		0.10;

    nCellsBetweenLevels		3;

    features		();

    refinementSurfaces
    {

        heat_transfer
        {

            level		(0 0);

            regions{}

        }

    }

    resolveFeatureAngle		95;

    refinementRegions{}

    locationInMesh		(5.0 5.000000000000001 4.5);

    allowFreeStandingZoneFaces		true;

}

snapControls
{

    nSmoothPatch		5;

    tolerance		5;

    nSolveIter		100;

    nRelaxIter		8;

    nFeatureSnapIter		10;

    implicitFeatureSnap		true;

    multiRegionFeatureSnap		true;

}

addLayersControls
{

    relativeSizes		true;

    layers{}

    expansionRatio		1.0;

    finalLayerThickness		0.3;

    minThickness		0.2;

    nGrow		0;

    featureAngle		60;

    nRelaxIter		3;

    nSmoothSurfaceNormals		1;

    nSmoothThickness		10;

    nSmoothNormals		3;

    maxFaceThicknessRatio		0.5;

    maxThicknessToMedialRatio		0.3;

    minMedianAxisAngle		90;

    nBufferCellsNoExtrude		0;

    nLayerIter		50;

    nRelaxedIter		20;

}

meshQualityControls
{

    maxNonOrtho		60;

    maxBoundarySkewness		20;

    maxInternalSkewness		4;

    maxConcave		80;

    minFlatness		0.5;

    minVol		1e-13;

    minTetQuality		1e-15;

    minArea		-1;

    minTwist		0.02;

    minDeterminant		0.001;

    minFaceWeight		0.02;

    minVolRatio		0.01;

    minTriangleTwist		-1;

    nSmoothScale		4;

    errorReduction		0.75;

}

debug		0;

mergeTolerance		1E-6;