etc/OpenFOAM_sample_files/heat_transfer/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volVectorField;
	location	"0";
	object		U;
}

dimensions		[0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);

boundaryField
{

    room
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

    floor
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

    roof
    {

        type		fixedValue;

        value		uniform (0 0 0);

    }

}