etc/OpenFOAM_sample_files/heat_transfer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		T;
}

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 300;

boundaryField
{

    room
    {

        type		fixedValue;

        value		uniform 373.15;

    }

    floor
    {

        type		fixedValue;

        value		uniform 291.15;

    }

    roof
    {

        type		fixedValue;

        value		uniform 873.15;

    }

}