etc/OpenFOAM_sample_files/heat_transfer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/* Butterfly 0.0.3       https://github.com/ladybug-analysis-tools/butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		4.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSolution;
}

solvers
{

    U
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    k
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    epsilon
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

    p_rgh
    {

        relTol		0.01;

        solver		PCG;

        preconditioner		DIC;

        tolerance		1e-08;

    }

    T
    {

        relTol		0.1;

        tolerance		1e-8;

        nSweeps		1;

        smoother		GaussSeidel;

        solver		smoothSolver;

    }

}

SIMPLE
{

    nNonOrthogonalCorrectors		2;

    residualControl
    {

        nut		0.0001;

        p_rgh		0.0001;

        k		0.0001;

        U		0.0001;

        T		0.0001;

        epsilon		0.0001;

        alphat		0.0001;

    }

    pRefValue		0;

    pRefPoint		(5.0 5.000000000000001 4.5);

}

relaxationFactors
{

    p_rgh		0.3;

    k		0.7;

    U		0.7;

    T		0.5;

    epsilon		0.7;

}