etc/OpenFOAM_sample_files/heat_transfer/system/probes

functions
{

    probes
    {

        functionObjectLibs		("libsampling.so");

        type		probes;

        name		probes;

        fields		(T U);

...

        writeControl		timeStep;

        writeInterval		1;

    }

}